--liquibase formatted sql
--changeset Helix:1
CREATE TABLE IF NOT EXISTS m4d_credential (
    id bigserial PRIMARY KEY,
    code varchar(255) NOT NULL,
    "name" varchar(255) NULL
);
CREATE INDEX idx_credential_code_name ON m4d_credential (code, name);
--changeset Helix:2
INSERT INTO m4d_credential(code, name) VALUES
    ('BBDOCS_CNTRCT_SRVC_СС_CNTRCTСС1', 'Заключать и подписывать договоры поручения о выдачи квалифицированных сертификатов ключа проверки электронной подписи'),
    ('GUC_CER_ACA_REV_CER_ACA', 'Подписывать запросы в головной удостоверяющий центр на аннулирование квалифицированного сертификата ключа проверки электронной подписи аккредитованного удостоверяющего центра'),
    ('BBDOCS_CNTRCT_SALE_DLVR_ACTDLVRGDSGENERAL', 'Подписывать акты сдачи-приемки товара (оборудования, работ, услуг)'),
    ('BBDOCS_CNTRCT_SRVC_CNNCTN_DOCSCNNCTN3', 'Подписывать, представлять и получать детализация счетов'),
    ('BBDOCS_CNTRCT_SRVC_SRVCWRK_DOCSWRK1', 'Подписывать акты выполнения работ'),
    ('BBDOCS_CNTRCT_INSRNC_LBLT_CNTRCTLBLT27', 'Заключать и подписывать договоры добровольного страхования гражданской ответственности организаций, эксплуатирующих опасные объекты (по договорам страхования с индивидуальными предпринимателями и юридическими лицами)'),
    ('BBDOCS_CNTRCT_SRVC_СС_DOCSССGENERAL', 'Подписывать документы, связанные с исполнением/неисполнением обязательств по договорам услуг/работ УЦ'),
    ('BBDOCS_CNTRCT_SALE_DLVR_CNTRCTDLVRGDS5', 'Заключать и подписывать соглашения с поставщиками товаров, в том числе, о порядке и условиях стимулирования (премирования)'),
    ('BBDOCS_CNTRCT_OBLGTN_SCRT_ADDTNLCNTSCRTGENERAL', 'Заключать и подписывать к договорам об обеспечительном платеже приложения, спецификации, дополнительные соглашения (соглашения) об их изменении, расторжении и прекращении'),
    ('BBDOCS_CNTRCT_INSRNC_PRPRT_CNTRCTPRPRT34', 'Заключать и подписывать договоры страхования имущества юридических лиц (кроме страхования транспортных средств и сельскохозяйственного страхования) от рисков при проведении строительно-монтажных работ'),
    ('DIT_EA0001', 'Контракт: Подписание ЭП протокола разногласий в рамках электронного подписания контракта с поставщиком'),
    ('DIT_CL0004', 'Подписывать в связи с исполнением государственных контрактов и гражданско-правовых договоров соглашения (договоры) о конфиденциальности (неразглашении конфиденциальной информации)');